numbers_tickets = int(input('Ввести количество билетов: '))
print("--------------------------")
sum = 0


for i in range(0, numbers_tickets):
    age = int(input(f'Ввести возраст участника {i+1}: '))
    if age < 18:
        print('Стоимость билета - 0 руб')
        print("--------------------------")
    elif 18 <= age < 25:
        sum += 990
        print('Стоимость билета - 990 руб')
        print("--------------------------")
    else:
        sum += 1390
        print('Стоимость билета - 1390 руб')
        print("--------------------------")


discount = int(sum * 0.9)
if numbers_tickets > 3:
    print('Стоимость всех приобретаемых билетов со скидкой:', sum, 'руб')
else:
    print('Стоимость всех приобретаемых билетов:', sum, 'руб')










